Revit 2027 API
BuiltInFailures.DetailFailures.EavesAreAligned Property
 All eaves are already aligned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EavesAreAligned { get; }
Public Shared ReadOnly Property EavesAreAligned As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EavesAreAligned {
	FailureDefinitionId^ get ();
}
static member EavesAreAligned : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DetailFailures Class
Autodesk.Revit.DB Namespace